# База данных формул для потоков КНТ (ВШЭ НН)

FORMULAS = {
    "potok_1": {
        "name": "1 поток (Математика и алгоритмы)",
        "items": {
            "Матэкан": "Итог = 0.3 * Накоп + 0.3 * КР + 0.4 * Экзамен",
            "Алгоритмы": "Итог = 0.4 * ДЗ + 0.2 * Колл + 0.4 * Экзамен"
        }
    },
    "potok_2": {
        "name": "2 поток (Программирование)",
        "items": {
            "Язык Python": "Итог = 0.5 * Проекты + 0.5 * Экзамен",
            "Дискретная математика": "Итог = 0.3 * КР1 + 0.3 * КР2 + 0.4 * Экз"
        }
    },
    "potok_3": {
        "name": "3 поток (Инженерия данных)",
        "items": {
            "Базы данных": "Итог = 0.6 * Лабы + 0.4 * Экзамен"
        }
    },
    "potok_4": {
        "name": "4 поток (Цифровые платформы)",
        "items": {
            "Введение в ТП": "Итог = 0.7 * Накоп + 0.3 * Защита"
        }
    }
}

